app/views/planifications/edit.html.erb

SELECT "lectures".* FROM "lectures" WHERE "lectures"."planification_id" = ?  [["planification_id", 29]]
---
  <div class="lecture-fields-wrapper">
  <% @planification.lectures.each do |lecture| %>