app/views/planifications/show.html.erb


  <% @planification.lectures.each do |lecture| %>
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."planification_id" = ?  [["planification_id", 2]]