app/views/grades_subjects_teachers/_form.html.erb

    <%= form.hidden_field :grade_id %>
    <%= form.select :grade_id, ["Agrega Nuevo Curso..."] | Grade.all.map { |g| [g.name, "#{g.id}"] } %>
    <%= form.hidden_field :subjects_teacher_id %>
    <%= form.hidden_field :subjects_teacher_id, value: SubjectsTeacher.find_by(subject_id: subject.id, user_id: user.id).id %>
---
SELECT "grades".* FROM "grades"
SELECT  "subjects_teachers".* FROM "subjects_teachers" WHERE "subjects_teachers"."user_id" = ? AND "subjects_teachers"."subject_id" = ? LIMIT ?  [["user_id", 1], ["subject_id", 1], ["LIMIT", 1]]