app/views/grades_subjects_teachers/show.html.erb

SELECT "planifications".* FROM "planifications" WHERE "planifications"."grades_subjects_teacher_id" = ?  [["grades_subjects_teacher_id", 1]]
---

	<% @grades_subjects_teacher.planifications.each do |p| %>