app/views/subjects_teachers/_form.html.erb

    <%= form.label :subject_id, 'Agregar Nueva Asignatura' %>
    <%= form.select :subject_id, ["Selecciona una Asignatura..."] | school.subjects.all.map { |s| [s.name, "#{s.id}"] } %>
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."school_id" = ?  [["school_id", 1]]