app/views/users/_teacher_profile.html.erb

SELECT  "schools".* FROM "schools" INNER JOIN "schools_users" ON "schools"."id" = "schools_users"."school_id" WHERE "schools_users"."user_id" = ? AND "schools"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "schools" INNER JOIN "schools_users" ON "schools"."id" = "schools_users"."school_id" WHERE "schools_users"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
<div class="w3-container">
  <% if @user.schools.any? %>

SELECT  "subjects".* FROM "subjects" INNER JOIN "subjects_teachers" ON "subjects"."id" = "subjects_teachers"."subject_id" WHERE "subjects_teachers"."user_id" = ? AND "subjects"."school_id" = ? LIMIT ?  [["user_id", 1], ["school_id", 1], ["LIMIT", 1]]
---
      <p>Asignaturas:</p>
      <% @user.subjects.where(school_id: school.id).find_each do |subject| %>

SELECT  "subjects_teachers".* FROM "subjects_teachers" WHERE "subjects_teachers"."subject_id" = ? AND "subjects_teachers"."user_id" = ? LIMIT ?  [["subject_id", 2], ["user_id", 1], ["LIMIT", 1]]
---
          <p> Cursos </p>
          <% @user.subjects_teachers.find_by(subject_id: subject.id).grades.each do |grade| %>