app/views/users/_teacher_schools.html.erb

  <div class="w3-container">
    <% if @user.schools.any? %>
---
SELECT  1 AS one FROM "schools" INNER JOIN "schools_users" ON "schools"."id" = "schools_users"."school_id" WHERE "schools_users"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "schools".* FROM "schools" INNER JOIN "schools_users" ON "schools"."id" = "schools_users"."school_id" WHERE "schools_users"."user_id" = ?  [["user_id", 1]]