app/views/users/_utp_profile.html.erb

<h2> Colegios Registrados </h2>
<% @user.schools.each do |school| %>
---
SELECT  "schools".* FROM "schools" INNER JOIN "schools_users" ON "schools"."id" = "schools_users"."school_id" WHERE "schools_users"."user_id" = ? ORDER BY "schools"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]