app/views/schools/show.html.erb


<% if @school.subjects.any? %>
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."school_id" = ? AND "subjects"."id" = ? LIMIT ?  [["school_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "subjects" WHERE "subjects"."school_id" = ? LIMIT ?  [["school_id", 1], ["LIMIT", 1]]