app/controllers/grades_subjects_teachers_controller.rb

SELECT  "grades_subjects_teachers".* FROM "grades_subjects_teachers" WHERE "grades_subjects_teachers"."subjects_teacher_id" = ? AND "grades_subjects_teachers"."grade_id" = ? LIMIT ?  [["subjects_teacher_id", 1], ["grade_id", 4], ["LIMIT", 1]]
SELECT  "subjects_teachers".* FROM "subjects_teachers" WHERE "subjects_teachers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @grades_subjects_teacher = GradesSubjectsTeacher.find(params[:id])

INSERT INTO "grades_subjects_teachers" ("grade_id", "subjects_teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["grade_id", 4], ["subjects_teacher_id", 1], ["created_at", "2017-05-16 15:51:20.653417"], ["updated_at", "2017-05-16 15:51:20.653417"]]
---
  def create
    @user = current_user
    @grades_subjects_teacher = GradesSubjectsTeacher.new(grades_subjects_teacher_params)
    respond_to do |format|
      if @grades_subjects_teacher.save