app/controllers/lectures_controller.rb

SELECT  "planifications".* FROM "planifications" WHERE "planifications"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
SELECT  "lectures".* FROM "lectures" WHERE "lectures"."planification_id" = ? AND "lectures"."id" = ? LIMIT ?  [["planification_id", 29], ["id", 37], ["LIMIT", 1]]
DELETE FROM "lectures" WHERE "lectures"."id" = ?  [["id", 37]]
---
  def destroy
  	@planification = Planification.find(params[:planification_id])
  	@lecture = @planification.lectures.find(params[:id])
  	@lecture.destroy