app/controllers/planifications_controller.rb

SELECT "planifications".* FROM "planifications"
---
  def index
    @search = Search.new
    @subjects = Subject.all.uniq.pluck(:name)
    @schools = School.all.uniq.pluck(:name)
    @grades = Grade.all.uniq.pluck(:name)
    @planifications = Planification.search(params)

SELECT  "grades_subjects_teachers".* FROM "grades_subjects_teachers" WHERE "grades_subjects_teachers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @planification = Planification.new
    @grades_subjects_teacher = GradesSubjectsTeacher.find(params[:grades_subjects_teacher_id])

SELECT "lectures".* FROM "lectures" WHERE "lectures"."planification_id" = ?  [["planification_id", 3]]
---
  def edit
    @n_lectures = @planification.lectures.length

SELECT  "grades_subjects_teachers".* FROM "grades_subjects_teachers" WHERE "grades_subjects_teachers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "planifications" ("name", "date", "rating", "downloads", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asd"], ["date", "2017-05-09"], ["rating", 0], ["downloads", 0], ["created_at", "2017-05-09 20:00:27.659118"], ["updated_at", "2017-05-09 20:00:27.659118"]]
---
  def create
    @gst = GradesSubjectsTeacher.find(params[:gst])
    @planification = @gst.planifications.build(planification_params)
    @planification.subject = @gst.subjects_teacher.subject.name
    @planification.school = @gst.subjects_teacher.subject.school.name
    @planification.grade = @gst.grade.name
    respond_to do |format|
      if @planification.save

DELETE FROM "planifications" WHERE "planifications"."id" = ?  [["id", 2]]
---
  def destroy
    @planification.destroy

SELECT  "planifications".* FROM "planifications" WHERE "planifications"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def set_planification
    @planification = Planification.find(params[:id])