app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "RBD", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "TEO"], ["RBD", "123"], ["address", "av ossa"], ["phone", "123123"], ["created_at", "2017-05-02 00:20:20.581281"], ["updated_at", "2017-05-02 00:20:20.581281"]]
---
  def create
    authorize! :create, School
    @user = current_user
    @school = @user.schools.build(school_params)
    @school.user_id = @user.id
    @user.schools << @school

DELETE FROM "schools" WHERE "schools"."id" = ?  [["id", 1]]
---
  def destroy
    authorize! :destroy, @school
    @school.destroy

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_school
    @school = School.find(params[:id])