app/controllers/subjects_teachers_controller.rb

INSERT INTO "subjects_teachers" ("subject_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subject_id", 1], ["user_id", 1], ["created_at", "2017-05-14 14:11:07.295515"], ["updated_at", "2017-05-14 14:11:07.295515"]]
---
  def create
    @user = current_user
    @subjects_teacher = @user.subjects_teachers.build(subjects_teacher_params)
    respond_to do |format|
      if @subjects_teacher.save