app/controllers/subjects_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "subjects" ("name", "description", "school_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Matemáticas"], ["description", ""], ["school_id", 1], ["created_at", "2017-05-06 00:26:40.647665"], ["updated_at", "2017-05-06 00:26:40.647665"]]
---
  def create
    @school = School.find(params[:school_id])
    @subject = @school.subjects.build(subjects_params)
    @subject.save

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."school_id" = ? AND "subjects"."id" = ? LIMIT ?  [["school_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def destroy
    @school = School.find(params[:school_id])
    @subject = @school.subjects.find(params[:id]).destroy