app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def unsubschool
    @user = User.find(params[:id])
    schoolid = params[:schoolid]
    @user.schools.delete(School.find(schoolid))

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "schools" INNER JOIN "schools_users" ON "schools"."id" = "schools_users"."school_id" WHERE "schools_users"."user_id" = ? AND "schools"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def subscribe_school
    @user = User.find(params[:id])
    schoolid = params[:schoolid]
    if schoolid == "Selecciona un colegio..."
      redirect_to @user, notice: 'Seleccione una opción válida.'
    elsif @user.schools.exists?(schoolid)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def schools
    @user = User.find(params[:id])